# editor: 百年
# time: 2024/2/23 16:25
# //tbody/tr[2]/td/a| //tbody/tr[2]/td[3]
import random

import requests
from lxml import etree
headers={
    'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36 Edg/110.0.1587.56',
}
proxies_pool=[
    {'http': '117.71.133.12:8089'},
    {'http':'36.6.145.77:8089'},
    {'http':'114.231.42.134:8888'},
    {'http':'183.164.243.170:8089'},
    {'http':'36.255.87.133:83'},
    {'http':'117.69.237.179:8089'},
    {'http':'114.231.46.231:8089'},
    {'http':'114.231.45.234:8089'},
    {'http':'114.231.82.92:8888'},
    {'http':'36.6.144.244:8089'},
    {'http':'117.71.154.22:8089'},
    {'http':'117.71.133.231:8089'},
    {'http':'117.69.237.21:8089'},
    {'http':'36.6.144.65:8089'},
    {'http':'60.174.0.215:8089'},
    {'http':'36.6.145.44:8089'},
    {'http':'36.6.145.90:8089'},
    {'http':'114.231.45.176:8089'},
    {'http':'114.231.45.30:8089'},
    {'http':'36.6.145.186:8089'},
    {'http':'113.223.212.96:8089'},
    {'http':'60.205.216.70:7777'},
    {'http':'117.57.92.238:8089'},
    {'http':'223.247.47.69:8089'},
    {'http':'117.69.232.171:8089'},
    {'http':'117.71.132.220:8089'},
    {'http':'183.164.242.167:8089'},
    {'http':'117.69.236.184:8089'},
    {'http':'183.164.243.10:8089'},
    {'http':'36.6.144.98:8089'},
    {'http':'114.231.82.28:8888'},
    {'http':'114.232.110.19:8888'},
    {'http':'114.231.42.56:8089'},
    {'http':'117.71.133.12:8089'},
    {'http':'117.71.132.89:8089'},
    {'http':'223.215.177.157:8089'},
    {'http':'117.69.232.190:8089'},
    {'http':'183.164.243.29:8089'},
    {'http':'117.57.93.90:8089'},
    {'http':'117.71.154.38:8089'},
    {'http':'36.6.145.213:8089'},
]
proxies=random.choice(proxies_pool)
print('所用的代理:',proxies)
url='https://xl.16888.com/ev.html'
response=requests.get(url=url, headers=headers,proxies=proxies)
content=response.text
print(content)
tree=etree.HTML(content)
car_info=tree.xpath('//tr[2]/td/a/text()| //tr[2]/td[3]/text()')
print(car_info)