# editor 百年
# date: 2023/12/29 20:00
# 赋值运算符，从右至左
a=3+4
print(a)
# 先算出3+4再赋值给a
a=b=c=20 #链式存储
print(a,id(a))
print(b,id(b))
print(c,id(c))
# 20 1450997842768
# 20 1450997842768
# 20 1450997842768
# 理解为指针，a,b,c都指向20这个值


# 除了链式存储外，还支持参数存储
a+=10
# 相当于a=a+10,即让a+10,再赋值给a
print(a)
# 30
b-=10
print(b)
c%=-3
# 相当于20-(-3*-7)=20-21=-1
print(c)


# 支持系列解包赋值
d,e,f=20,30,40
print(d,e,f)
# 20 30 40
# 注意，左边的参数要和右边的数字相同，不然便会报错

# 交换两个变量的数值
v,m=10,20
print('交换前',v,m)
# 交换
v,m=m,v
print('交换后',v,m)
# 交换前 10 20
# 交换后 20 10