# editor 百年
# date: 2023/12/30 13:38
# 位运算符，将数据转化为二进制再进行计算
# & | << >>

# & 与运算符
# 00001000
# 00010000
# 00000000

a=0b10001100
b=0b01110011
c=a&b
print(c)
# 0
# 1&0 为0 1&1 为1

# | 或运算符
# 10000000
# 11000000
# 11000000
# 1|0=1 1|1=1 0|0=0
c=0b11000000
d=0b10000001
e=c|d
print(e)
# 推算应该为0b11000001 = 193
# 193 <--正确

# 左移运算符
# 0b01000000 << 1 = 0b10000000
f=0b00100000
g=0b00100000 <<2
# 推算左移2位置 应该为10000000 =128
print(g)
# 128 <--正确
# 推广
f1=0b10000000
f2=f1 <<1
# 推算128 左移一位应为256
print(f2)
# 256
f3=f1<<2
print(f3)
# 512 高位溢出，低位补0


# 右移运算
# 0b00000001 >>1 =0b00000000
q1=0b00000001
q2=q1>>1
print(q2)
# 0
q3=q1>>2
print(q3)
# 0 <--低位截断
