# editor 百年
# date: 2024/1/2 17:50
# 列表生成式即为’生成列表的公式‘
'''
语法格式
[ i for i in range(1,10)]
'''
lst1=[i for i in range(1,10)]
print(lst1)
# [1, 2, 3, 4, 5, 6, 7, 8, 9]

lst2=[i*i for i in range(1,10)]
print(lst2)
# [1, 4, 9, 16, 25, 36, 49, 64, 81] <--输出1-9的平方项作为列表的元素

lst3=[i*2 for i in range(1,11)]
print(lst3)
# [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]

# # 问题，要求输出的列表为2的平方项系数，从2开始，到65536结束
# 利用pow(底数，幂),再利用range(start,stop,step) 来定义取2^0,2^3,2^4
lst4=[pow(2,i) for i in range(0,17)]
print(lst4)
# [1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, 2048, 4096, 8192, 16384, 32768, 65536]
