# editor 百年
# date: 2024/1/4 14:56
'''
什么是元组？
元组的创建方式
元组的遍历操作
'''

# 元组 ：python的内置数据结构之一，是一个不可变序列

# 不可变序列与可变序列
'''
不可变序列：字符串、元组、集合
不可变序列没有增删改的操作

可变序列：列表、字典
可变序列：可以对序列执行增删改操作，对象地址不发生改变
'''

# 可变序列
lst1=[1,2,3,4,5,6]
lst2=[7,8,9]
dic1={'张三':25,'李四':22,'王五':16}
lst1.extend(lst2)
print(id(lst1))
# 2051767424384
print(lst1,id(lst1))
# [1, 2, 3, 4, 5, 6, 7, 8, 9] 2158213682560  <--列表对象的标识不会发生更改

print(id(dic1))
# 2128399049856
dic1['赵六']=18
print(dic1,id(dic1))
# {'张三': 25, '李四': 22, '王五': 16, '赵六': 18} 2128399049856 <--字典对象的标识未发生更改


# 不可变序列
s='hello,python'
print(id(s))
# 1678277991472
s=s+' hello world'
# 1678280634288 <--标识发生改变
print(id(s))
print(s)
# hello,python hello world


# 元组
tp1=('小明','小红','小花')
print(tp1)
# ('小明', '小红', '小花')