# editor 百年
# date: 2024/1/6 14:54
'''
集合操作
1.求交集 A&B
2.求并集A|B
3.求A对于B的差集 A|B - B （A与B的并集减去B集合）
4.对称差集 A|B-A&B （A和B的并集减去A和B的交集）
'''

A={1,2,3,4,5,6,7,8,9,11,15,66}
B={1,2,4,5,0,12}


# 1.求交集 A&B
print(A&B)
# 或者，利用print(A.intersection(B))
# {1, 2, 4, 5}

# 2.求并集A|B
print(A|B)
# 或者，利用print(A.union(B))
# {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 66, 11, 12, 15}

# 3.求A对于B的差集 A- B （A集减去B集合）
print(A-B)
# 或者，利用print(A.difference(B))
#{66, 3, 6, 7, 8, 9, 11, 15}

# 4.对称差集 (A|B)-(A&B )（A和B的并集减去A和B的交集）

# 错误示范，注意优先级，算数运算符为第一位，逻辑运算符优先级低于算数运算符
print(A|B-A&B)
# {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 66, 11, 12, 15}

# 或者，加括号，小括号内的优先级高
print((A|B)-(A&B))
# 或者print(A.symmetric_difference(B))
print(A.symmetric_difference(B))
# {0, 66, 3, 6, 7, 8, 9, 11, 12, 15}

# 正确写法
C=A|B
D=A&B
print(C-D)
# {0, 66, 3, 6, 7, 8, 9, 11, 12, 15}

# 又或者
print(A^B)
# {0, 66, 3, 6, 7, 8, 9, 11, 12, 15}
