# editor 百年
# date: 2024/1/8 20:14

# %宽度.精度

print('%10d'%99) #10表示宽度，写几就是几
print('helloworld')
#         99
# helloworld
# 可以发现采用右边补齐空格的方式补上八个空格
print(len('helloworld'))
# 10

print('%f'%3.14159265)
# 3.141593

# 可以指示精度%.2f表示保留两位小数
print('%.2f'%3.146)
# 3.15

# 还可以这样写%宽度.精度
print('%10.3f'%3.1415)
print('helloworld')
#      3.142
# helloworld

# 利用{}方式也可以指定精度和宽度
# {}

print('{0}'.format(3.1415926))
# 3.1415926

# 指定宽度为3,注意0只是占位符，可不写
print('{0:.3}'.format(3.1415926))
# 3.14

# 保留三位小数
print('{0:.3f}'.format(3.1415926))
# 3.142

# 指定宽度为3且精度也为3
print('{:10.3f}'.format(3.1415926))
#      3.142